app/Models/AttendanceModel.php

SELECT `tb_attendance`.*, `tb_employee`.`username` as `employee_name`
FROM `tb_attendance`
JOIN `tb_employee` ON `tb_attendance`.`id_employee` = `tb_employee`.`id_employee`
---
    public function getAttendanceWithEmployeeNames()
    {
        return $this->select('tb_attendance.*, tb_employee.username as employee_name')
            ->join('tb_employee', 'tb_attendance.id_employee = tb_employee.id_employee')
            ->findAll();